# Brewfile — minimal, curated install set for the canonical workflow.
# Regenerate-with-care: `brew bundle dump` will re-add everything currently
# installed, including experimental one-offs. Prefer editing this file by hand
# so it stays a deliberate record of the tools that matter.
#
# Run:  brew bundle --file=~/.config/Brewfile

# --- Taps -------------------------------------------------------------------
tap "jandedobbeleer/oh-my-posh"   # prompt (fish)
tap "koekeishiya/formulae"        # yabai + skhd (alternative WM, kept tracked)
tap "manaflow-ai/cmux"            # primary terminal/workspace app
tap "nikitabobko/tap"             # aerospace (primary WM)
tap "yakitrak/yakitrak"           # obsidian-cli

# --- CLI tools --------------------------------------------------------------
brew "cmake"
brew "deno"
brew "fd"
brew "ffmpeg"          # media; also used by yazi previews
brew "fish"
brew "fzf"             # fuzzy finder; also powers zoxide's interactive `zi`
brew "node"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "imagemagick"     # image previews (yazi)
brew "jq"
brew "lazygit"
brew "lua"
brew "neovim"
brew "ninja"
brew "ripgrep"
brew "pnpm"
brew "poppler"         # PDF previews (yazi)
brew "powerlevel10k"
brew "resvg"           # SVG previews (yazi)
brew "sevenzip"
brew "tmux"
brew "tree"
brew "uv"
brew "yazi"
brew "zoxide"          # core: smart `cd` (z / zi). Initialized in fish/zsh/bash; needs fzf for `zi`
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "yakitrak/yakitrak/obsidian-cli"

# --- Casks (GUI apps + fonts) ----------------------------------------------
cask "1password-cli"
cask "nikitabobko/tap/aerospace"  # primary WM
cask "aldente"                    # battery charge limiter
cask "cmux"                       # primary terminal
cask "codex"
cask "cursor"                     # primary GUI editor
cask "font-caskaydia-cove-nerd-font"
cask "font-symbols-only-nerd-font"
cask "karabiner-elements"
cask "obsidian"
cask "raycast"
cask "shottr"                     # screenshots
cask "slack"

# --- VS Code / Cursor extensions -------------------------------------------
vscode "alefragnani.bookmarks"
vscode "anysphere.csharp"
vscode "anysphere.remote-ssh"
vscode "asvetliakov.vscode-neovim"
vscode "bradlc.vscode-tailwindcss"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "github.vscode-github-actions"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "redhat.vscode-yaml"
vscode "sainnhe.gruvbox-material"
vscode "tomoki1207.pdf"

# --- Language package managers ---------------------------------------------
cargo "cargo-generate"
cargo "cargo-machete"
uv "modal", with: ["python-dotenv"]
# (corepack ships with node; pnpm comes from brew — no npm globals needed)
