tap "antoniorodr/memo"
tap "cerebriumai/tap"
tap "felixkratz/formulae"
tap "jandedobbeleer/oh-my-posh"
tap "koekeishiya/formulae"
tap "manaflow-ai/cmux"
tap "nikitabobko/tap"
tap "openhue/cli"
tap "steipete/tap"
tap "ten-framework/ten-framework"
tap "xdevplatform/tap"
tap "yakitrak/yakitrak"
brew "cava"
brew "claude-squad"
brew "cmake"
brew "cocoapods"
brew "deno"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "flyctl"
brew "fzf"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "hf"
brew "himalaya"
brew "httrack"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "lua"
brew "mysql"
brew "neovim"
brew "ninja"
brew "ollama"
brew "openai-whisper"
brew "ripgrep"
brew "opencode"
brew "p7zip"
brew "pnpm"
brew "poppler"
brew "powerlevel10k"
brew "premake"
brew "resvg"
brew "sevenzip"
brew "summarize"
brew "tmux"
brew "tree"
brew "uv"
brew "watchman"
brew "yarn"
brew "yazi"
brew "zoxide"
brew "antoniorodr/memo/memo"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "openhue/cli/openhue-cli"
brew "steipete/tap/camsnap"
brew "steipete/tap/gifgrep"
brew "steipete/tap/gogcli"
brew "steipete/tap/goplaces"
brew "steipete/tap/imsg"
brew "steipete/tap/ordercli"
brew "steipete/tap/peekaboo"
brew "steipete/tap/remindctl"
brew "steipete/tap/sag"
brew "steipete/tap/songsee"
brew "steipete/tap/wacli"
brew "yakitrak/yakitrak/obsidian-cli"
cask "1password-cli"
cask "nikitabobko/tap/aerospace"
cask "aldente"
cask "betterdisplay"
cask "cerebriumai/tap/cerebrium"
cask "cmux"
cask "codex"
cask "steipete/tap/codexbar"
cask "cursor"
cask "dropzone"
cask "font-caskaydia-cove-nerd-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "mac-mouse-fix"
cask "ngrok"
cask "obsidian"
cask "raycast"
cask "shottr"
cask "slack"
cask "wezterm"
cask "xdevplatform/tap/xurl"
vscode "alefragnani.bookmarks"
vscode "anysphere.csharp"
vscode "anysphere.remote-ssh"
vscode "asvetliakov.vscode-neovim"
vscode "bradlc.vscode-tailwindcss"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "github.vscode-github-actions"
vscode "jonathanharty.gruvbox-material-icon-theme"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "redhat.vscode-yaml"
vscode "sainnhe.gruvbox-material"
vscode "tomoki1207.pdf"
cargo "cargo-generate"
cargo "cargo-machete"
uv "graphifyy"
uv "modal", with: ["python-dotenv"]
uv "nano-pdf"
uv "pipecat-ai-cli"
npm "@earendil-works/pi-coding-agent"
npm "@steipete/oracle"
npm "agent-browser"
npm "clawhub"
npm "corepack"
npm "gyst"
npm "mcporter"
npm "openclaw"
